* 工作
** DONE 进行中 [#A] 微信支付本地测试前看完微信小程序教程
   CLOSED: [2020-11-07 六 05:46] DEADLINE: <2020-10-29 四>
   :LOGBOOK:
   CLOCK: [2020-10-29 四 14:07]--[2020-10-29 四 14:11] =>  0:04
   :END:
* Work
** DONE 时间规划 [100%][4/4]
   CLOSED: [2020-11-21 六 11:20] DEADLINE: <2020-11-21 六 11:30> SCHEDULED: <2020-11-21 六 11:10>
   
   - State "DONE"       from              [2020-11-21 六 11:20]
*** DONE 抓取事情
    CLOSED: [2020-11-21 六 20:43]
    - State "DONE"       from "STARTED"    [2020-11-21 六 20:43]
    :LOGBOOK:
    CLOCK: [2020-11-21 六 11:24]--[2020-11-21 六 12:24] =>  1:00
    :END:
*** DONE 事项分类
    CLOSED: [2020-11-21 六 11:15]
    - State "DONE"       from "STARTED"    [2020-11-21 六 11:15]
    :LOGBOOK:
    CLOCK: [2020-11-21 六 11:13]--[2020-11-21 六 11:15] =>  0:02
    :END:
*** DONE 计时
    CLOSED: [2020-11-21 六 11:18]
    - State "DONE"       from "STARTED"    [2020-11-21 六 11:18]
    :LOGBOOK:
    CLOCK: [2020-11-21 六 11:17]--[2020-11-21 六 11:18] =>  0:01
    :END:
*** DONE 统计
    CLOSED: [2020-11-21 六 11:20]
    - State "DONE"       from "STARTED"    [2020-11-21 六 11:20]
    :LOGBOOK:
    CLOCK: [2020-11-21 六 11:19]--[2020-11-21 六 11:20] =>  0:01
    :END:
    
** CANCELLED [#A] 学python [0/3]
   CLOSED: [2020-11-23 一 19:02]
   - State "CANCELLED"  from "STARTED"    [2020-11-23 一 19:02]
*** STARTED 08.面向对象编程基础.md
    :LOGBOOK:
    CLOCK: [2020-11-21 六 13:40]--[2020-11-21 六 14:25] =>  0:45
    :END:
*** STARTED 09.面向对象进阶.md
    :LOGBOOK:
    CLOCK: [2020-11-21 六 19:55]--[2020-11-21 六 20:11] =>  0:16
    :END:
*** 10.图形用户界面和游戏开发.md
*** 11.文件和异常.md
*** 12.字符串和正则表达式.md
*** 13.进程和线程.md
*** 14.网络编程入门和网络应用开发.md
*** 15.图像和办公文档处理.md
 
 
  [2020-11-21 六 11:25]
** CANCELLED python学习手册
   CLOSED: [2020-11-23 一 19:02]
   - State "CANCELLED"  from "TODO"       [2020-11-23 一 19:02]
*** DONE 入门
    CLOSED: [2020-11-21 六 20:43]
    - State "DONE"       from "STARTED"    [2020-11-21 六 20:43]
    :LOGBOOK:
    CLOCK: [2020-11-21 六 20:13]--[2020-11-21 六 20:43] =>  0:30
    :END:
*** DONE 类型
    CLOSED: [2020-11-22 日 11:36]
    
    - State "DONE"       from "STARTED"    [2020-11-22 日 11:36]
    :LOGBOOK:
    CLOCK: [2020-11-22 日 05:41]--[2020-11-22 日 06:26] =>  0:45
    CLOCK: [2020-11-21 六 20:43]--[2020-11-21 六 20:58] =>  0:15
    :END:
*** STARTED 语法
    :LOGBOOK:
    CLOCK: [2020-11-22 日 11:36]--[2020-11-22 日 12:21] =>  0:45
    :END:
*** TODO 函数
*** TODO [#B] 模块
*** TODO 类
*** TODO 异常
*** TODO unicode
*** TODO 属性
*** TODO 装饰器
*** TODO 元类
*** TODO 附录

** STARTED [#A] JavaScript
   :LOGBOOK:
   CLOCK: [2020-12-01 二 09:29]
   :END:
   [2020-12-01 二 08:45]
** TODO [#A] Promises
** TODO [#A] Standard Style - Style guide and linter.
** TODO [#A] Must Watch Talks
** TODO [#A] Tips
** TODO [#A] Network Layer
** TODO [#A] Micro npm Packages
** TODO [#A] Mad Science npm Packages - Impossible sounding projects that exist.
** TODO [#A] Maintenance Modules - For npm packages.
** TODO [#A] npm - Package manager.
** TODO [#A] AVA - Test runner.
** TODO [#A] ESLint - Linter.
** TODO [#A] Functional Programming
** TODO [#A] Observables
** TODO [#A] npm scripts - Task runner.
** TODO [#A] 30 Seconds of Code - Code snippets you can understand in 30 seconds.
** TODO [#A] Ponyfills - Like polyfills but without overriding native APIs.
  
  [2020-12-01 二 08:45]

  
